app/views/courses/show.html.erb

        <tbody>
            <% @course.lectures.each do |lecture| %>
---
SELECT "lectures".* FROM "lectures" WHERE "lectures"."course_id" = ?  [["course_id", 4]]

                        <a>
                            <%= lecture.comments.size %>
---
SELECT  "comments".* FROM "comments" WHERE "comments"."lecture_id" = ?  ORDER BY "comments"."id" DESC LIMIT 1  [["lecture_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."lecture_id" = ?  [["lecture_id", 4]]

                        <%= 'by' if lecture.comments.size != 0 %>
                            <%= link_to lecture.comments.last.user.name if lecture.comments.size != 0 %><br><small><i class="fa fa-clock-o"></i><%= time_ago_in_words(lecture.comments.last.created_at)+" ago" if lecture.comments.size != 0 %></small></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]