app/controllers/courses_controller.rb

  def index
    @courses = Course.all
    @courses = Course.page(params[:page]).per(8)
---
SELECT  "courses".* FROM "courses" LIMIT 8 OFFSET 0

  def set_course
    @course = Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 4]]