app/controllers/lectures_controller.rb

    def set_lecture
      @lecture = Lecture.find_by_id(params[:id])
---
SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]